# -*- coding: utf-8 -*-
"""
Created on Tue Oct 23 21:34:36 2018

@author: Tom-Hu
"""

# -*- coding: utf-8 -*-
"""
Created on Sun Oct 21 20:04:13 2018

@author: Tom-Hu
"""

from pylab import *
xing=['李',	'王',	'张',	'刘',	'陈',	'杨',	'赵',	'黄',	'周',	'吴',\
'徐',	'孙',	'胡',	'朱',	'高',	'林',	'何',	'郭',	'马',	'罗',\
'梁',	'宋',	'郑',	'谢',	'韩',	'唐',	'冯',	'于',	'董',	'萧',\
'程',	'曹',	'袁',	'邓',	'许',	'傅',	'沈',	'曾',	'彭',	'吕',\
'苏',	'卢',	'蒋',	'蔡',	'贾',	'丁',	'魏',	'薛',	'叶',	'阎',\
'余',	'潘',	'杜',	'戴',	'夏',	'钟',	'汪',	'田',	'任',	'姜','欧阳']
ming=[	'一',	'是',	'丹',	'不',	'了',	'有',	'和',	'人',	'这',	'中',	'大',	'为',	'上',	'个',	'国',	'我',	'以',	'要',	'杰',\
'时',	'来',	'用',	'们',	'生',	'瑞',	'作',	'地',	'于',	'出',	'就',	'分',	'对',	'成',	'会',	'可',	'主',	'发',	'年',	'动',\
'同',	'工',	'也',	'能',	'下',	'过',	'子',	'说',	'产',	'种',	'面',	'而',	'方',	'后',	'多',	'定',	'行',	'学',	'法',	'所',\
'民',	'得',	'经',	'十',	'三',	'之',	'进',	'着',	'等',	'部',	'度',	'家',	'电',	'力',	'里',	'如',	'水',	'化',	'高',	'自',\
'二',	'理',	'起',	'小',	'物',	'现',	'实',	'加',	'量',	'都',	'两',	'体',	'制',	'机',	'当',	'使',	'点',	'从',	'业',	'本',\
'悦',	'琪',	'性',	'好',	'应',	'开',	'它',	'合',	'还',	'因',	'由',	'其',	'些',	'然',	'前',	'外',	'天',	'政',	'四',	'日',\
'那',	'社',	'义',	'事',	'平',	'形',	'相',	'全',	'表',	'间',	'样',	'与',	'关',	'各',	'重',	'新',	'线',	'内',	'数',	'正',\
'心',	'反',	'你',	'明',	'看',	'原',	'又',	'么',	'利',	'比',	'或',	'但',	'质',	'气',	'第',	'向',	'道',	'命',	'此',	'变',\
'条',	'只',	'没',	'结',	'解',	'问',	'意',	'建',	'月',	'公',	'无',	'系',	'军',	'很',	'情',	'者',	'最',	'立',	'代',	'想',\
'已',	'通',	'并',	'提',	'直',	'题',	'党',	'程',	'展',	'五',	'果',	'料',	'象',	'员',	'革',	'位',	'入',	'常',	'文',	'总',\
'次',	'品',	'式',	'俊',	'设',	'及',	'管',	'特',	'件',	'长',	'求',	'老',	'头',	'基',	'资',	'边',	'流',	'路',	'级',	'少',\
'图',	'山',	'统',	'接',	'知',	'较',	'将',	'组',	'见',	'计',	'别',	'她',	'手',	'角',	'期',	'根',	'论',	'运',	'农',	'指',\
'几',	'九',	'区',	'强',	'放',	'决',	'西',	'被',	'干',	'做',	'必',	'战',	'先',	'回',	'则',	'任',	'取',	'据',	'处',	'队',\
'南',	'给',	'色',	'光',	'门',	'即',	'保',	'治',	'北',	'造',	'百',	'规',	'热',	'领',	'七',	'海',	'口',	'东',	'导',	'器',\
'压',	'志',	'世',	'金',	'增',	'争',	'济',	'阶',	'油',	'思',	'术',	'极',	'交',	'受',	'联',	'什',	'认',	'六',	'共',	'权',\
'收',	'证',	'改',	'清',	'己',	'美',	'再',	'采',	'转',	'更',	'单',	'风',	'切',	'打',	'白',	'教',	'速',	'花',	'带',	'安',\
'场',	'身',	'车',	'例',	'真',	'务',	'具',	'万',	'每',	'目',	'至',	'达',	'刚',	'积',	'示',	'议',	'声',	'报',	'斗',	'完',\
'类',	'八',	'离',	'华',	'名',	'确',	'才',	'科',	'张',	'信',	'马',	'节',	'话',	'米',	'整',	'空',	'元',	'况',	'今',	'集',\
'温',	'传',	'土',	'许',	'步',	'群',	'广',	'石',	'记',	'需',	'段',	'研',	'界',	'拉',	'林',	'律',	'叫',	'且',	'究',	'观',\
'越',	'织',	'装',	'影',	'算',	'低',	'持',	'音',	'众',	'书',	'布',	'复',	'容',	'儿',	'须',	'际',	'商',	'非',	'验',	'连',\
'断',	'深',	'难',	'近',	'矿',	'千',	'周',	'委',	'素',	'技',	'备',	'半',	'办',	'青',	'省',	'列',	'习',	'响',	'约',	'支',\
'般',	'史',	'感',	'劳',	'便',	'团',	'往',	'酸',	'历',	'市',	'克',	'何',	'除',	'消',	'构',	'府',	'称',	'太',	'准',	'精',\
'值',	'号',	'率',	'族',	'维',	'划',	'选',	'标',	'写',	'存',	'候',	'毛',	'亲',	'快',	'效',	'斯',	'院',	'查',	'江',	'型',\
'眼',	'王',	'按',	'格',	'养',	'易',	'置',	'派',	'层',	'片',	'始',	'却',	'专',	'状',	'育',	'厂',	'京',	'识',	'适',	'属',\
'圆',	'包',	'火',	'住',	'调',	'满',	'县',	'局',	'照',	'参',	'红',	'细',	'引',	'听',	'该',	'铁',	'价',	'严',	'龙',	'飞'
]
gender=['男','女']
year=['01',	'02',	'03',	'04',	'05',	'06',	'07',	'08',	'09',	'10',	'11',	'12',	'13',	'14',	'15',	'16',	'17',	'18',	'19']
month=['1',	'2',	'3',	'4',	'5',	'6',	'7',	'8',	'9',	'10',	'11',	'12']
day=['01',	'02',	'03',	'04',	'05',	'06',	'07',	'08',	'09',	'10',	'11',	'12',	'13',	'14',	'15',	'16',	'17',	'18',	'19',	'20',	'21',	'22',	'23',	'24',	'25',	'26',	'27',	'28']
province=['河北',	'山西',	'辽宁',	'吉林',	'黑龙江',	'江苏',	'浙江',	'安徽',	'福建',	'江西',	'山东',	'河南',	'湖北',	'湖南',	'广东',	'海南',	'四川',	'贵州',	'云南',	'陕西',	'甘肃',	'青海',	'台湾',	'北京',	'天津',	'上海',	'重庆',	'河北',	'山西',	'辽宁',	'吉林',	'黑龙江',	'江苏',	'浙江',	'安徽',	'福建',	'江西',	'山东',	'河南',	'湖北',	'湖南',	'广东',	'海南',	'四川',	'贵州',	'云南',	'陕西',	'甘肃',	'青海',	'台湾']
def rand_name_generator(n):
    names=''
    for _ in range(n):
        xid=randint(0,len(xing))
        ming_len=randint(1,2)
        name=xing[xid]
        for _ in range(ming_len):
            mid=randint(1,len(ming))
            name+=ming[mid]
        names+='\''+name+'\''+'\n'
    print(names)

def rand_gender_generator(n):
    genders=''
    for _ in range(n):
        gid=randint(0,2)
        gender_=gender[gid]
        genders+='\''+gender_+'\''+'\n'
    print(genders)

def rand_date_generator(n):
    dates=''
    for _ in range(n):
        yid=17
        mid=randint(0,len(month))
        did=randint(0,len(day))
        date_=day[did]+'-'+month[mid]+'月'+'-'+year[yid]
        dates+='\''+date_+';'+'\n'
    print(dates)
def rand_province_generator(n):
    provinces=''
    for _ in range(n):
        pid=randint(0,len(province))
        province_=province[pid]
        provinces+='\''+province_+'\''+'\n'
    print(provinces)
def rand_age_generator(n):
    ages=''
    for _ in range(n):
        age=randint(18,22)
        ages+=str(age)+'\n'
    print(ages)
    
    
rand_date_generator(14)
rand_province_generator(14)
rand_age_generator(14)
rand_name_generator(14)
rand_gender_generator(14)